{"runs": [{"o_u": "0.01", "ovr": "0.1", "bat": "300631", "r_t": "4", "bowl": "391485", "r": "4", "comm": "in case anyone was confused over the format, Kusal reminds them with a biff down the ground and sends the crowd into rapture. Seemed a pretty decent delivery, but the batsman believed he could get under it. Not perfectly timed, but it had the legs to soar over mid-off and carry on", "x": "245", "y": "353", "o_a": "0.1", "z": "4"}, {"o_u": "0.02", "ovr": "0.2", "bat": "300631", "r_t": "1", "bowl": "391485", "r": "1", "comm": "immediately the adjustment is made, and a clever batsman could predict it. Kusal stays back, jumps up to get on top of the short ball at the hip and finds a single to square leg", "x": "144", "y": "114", "o_a": "0.2", "z": "8"}, {"o_u": "0.03", "ovr": "0.3", "bat": "48472", "r_t": "1", "bowl": "391485", "r": "1", "comm": "tight single to Bravo at mid-on, and Kusal would have been struggling at the strikers' end had that hit. The throw just whistles past. Dilshan off the mark, as he was hoping to do, after blocking the back of a length ball with soft hands", "x": "200", "y": "199", "o_a": "0.3", "z": "4"}, {"o_u": "0.04", "ovr": "0.4", "bat": "300631", "r_t": "0", "bowl": "391485", "r": "0", "comm": "short and on off stump this time, blocked into the covers. Very little margin of error with that length but it might be the best course of action against Kusal", "x": "239", "y": "189", "o_a": "0.4", "z": "3"}, {"o_u": "0.05", "ovr": "0.5", "bat": "300631", "r_t": "4", "bowl": "391485", "r": "4", "comm": "seeks the back of a length delivery again, but it doesn't rise up enough to be threatening nor does it have pace. Kusal just stands and pastes it through midwicket.", "x": "31", "y": "284", "o_a": "0.5", "z": "6"}, {"o_u": "0.06", "ovr": "0.6", "bat": "300631", "r_t": "0", "bowl": "391485", "r": "0", "comm": "135 kph, pulls his length back and uses his height to get a little more bounce. Thuds into his thigh pad as he tries to flick and misses", "x": "233", "y": "209", "o_a": "0.6", "z": "3"}, {"o_u": "1.01", "ovr": "1.1", "bat": "48472", "r_t": "4", "bowl": "53191", "r": "4", "comm": "sweetly timed and Holder has to watch another one hurry to the fence, as a fielder this time. Almost seems a naive delivery - looking for swing and angled into leg stump. There is nothing on offer and Dilshan whips it to the long leg boundary", "x": "343", "y": "118", "o_a": "1.1", "z": "2"}, {"o_u": "1.02", "ovr": "1.2", "bat": "48472", "r_t": "4", "bowl": "53191", "r": "4", "comm": "not quite timed, but the square boundaries are the shortest here and Dilshan takes full toll. Cleared the front leg, takes the back of a good length delivery and pulls it to the midwicket boundary", "x": "345", "y": "238", "o_a": "1.2", "z": "3"}, {"o_u": "1.03", "ovr": "1.3", "bat": "48472", "r_t": "0", "bowl": "53191", "r": "0", "comm": "that certainly deviated. Fuller delivery kisses the pitch and seams away - again no movement through the air. Dilshan goes for the expansive drive and comes up with zilch", "x": "216", "y": "178", "o_a": "1.3", "z": "3"}, {"o_u": "1.04", "ovr": "1.4", "bat": "48472", "r_t": "1", "bowl": "53191", "r": "1", "comm": "slower ball, right up there on off stump, Dilshan nudges to mid-on and runs again. Narine this time misses the target.", "x": "242", "y": "202", "o_a": "1.4", "z": "3"}, {"o_u": "1.05", "ovr": "1.5", "bat": "300631", "r_t": "0", "bowl": "53191", "r": "0", "comm": "142 kph, fierce, fast and curling in. Taylor has found his menace. Needs that extra pace to make the batsman look all at sea. Kusal can't adjust to the movement and is rapped on the pads. Would have gone down leg", "x": "0", "y": "0", "o_a": "1.5", "z": "0"}, {"o_u": "1.06", "ovr": "1.6", "bat": "300631", "r_t": "0", "bowl": "53191", "r": "0", "comm": "another desperately full delivery - already on damage control are West Indies - as Kusal flashes and misses", "x": "0", "y": "0", "o_a": "1.6", "z": "0"}, {"o_u": "2.01", "ovr": "2.1", "bat": "48472", "r_t": "4", "bowl": "53115", "r": "4", "comm": "there it is! He takes the record with his trademark Dilscoop. Length ball, with little pace. Dilshan sees no threat in it as he gets down on one knee - did it a little too soon, so he waits and then deflects the ball past short fine leg", "x": "219", "y": "7", "o_a": "2.1", "z": "1"}, {"o_u": "2.02", "ovr": "2.2", "bat": "48472", "r_t": "1", "bowl": "53115", "r": "1", "comm": "full and outside off, drilled to mid-off", "x": "143", "y": "249", "o_a": "2.2", "z": "5"}, {"o_u": "2.03", "ovr": "2.3", "bat": "300631", "r_t": "4", "bowl": "53115", "r": "4", "comm": "goes around the stumps, the lack of pace is pleasing to Kusal as well, runs down the track and sends the ball to the long-on boundary. Came off the bottom of the bat but was always headed for the boundary. The longest side of the ground too", "x": "160", "y": "355", "o_a": "2.3", "z": "5"}, {"o_u": "2.04", "ovr": "2.4", "bat": "300631", "r_t": "0", "bowl": "53115", "r": "0", "comm": "<b>run out chance</b>. Kusal was not even in the frame. He took ages to turn after committing too far to a quick single off his pads. Sammy dupes him with a really slower ball, but fails to capitalise. Runs across to field the ball himself, had three stumps to aim at and time too, but doesn't hit his mark", "x": "0", "y": "0", "o_a": "2.4", "z": "0"}, {"o_u": "2.05", "ovr": "2.5", "bat": "300631", "r_t": "0", "bowl": "53115", "r": "0", "comm": "good length ball, keeps it out.", "x": "235", "y": "186", "o_a": "2.5", "z": "3"}, {"o_u": "2.06", "ovr": "2.6", "bat": "300631", "r_t": "4", "bowl": "53115", "r": "4", "comm": "hands on his head and head tossed back as Sri Lanka tuck themselves to another boundary. Could have been a dead duck for a lbw as he went down on one knee to sweep. This ends up a full toss angled into middle, but he connects perfectly and it goes to the square leg boundary", "x": "69", "y": "42", "o_a": "2.6", "z": "8"}, {"o_u": "3.01", "ovr": "3.1", "bat": "48472", "r_t": "4", "bowl": "53191", "r": "4", "comm": "no respite! Clears the front leg, sizes up the slower ball, waits in the power position and smears it away through midwicket. Goes past 1500 runs in T20Is", "x": "347", "y": "247", "o_a": "3.1", "z": "3"}, {"o_u": "3.02", "ovr": "3.2", "bat": "48472", "r_t": "1", "bowl": "53191", "r": "1", "comm": "full and into the pads, to try and cramp the batsman up, flicked to deep square leg", "x": "325", "y": "187", "o_a": "3.2", "z": "3"}, {"o_u": "3.03", "ovr": "3.3", "bat": "300631", "r_t": "0", "bowl": "53191", "r": "0", "comm": "short and slow and outside off, Kusal waits on his toes and glides it to point", "x": "238", "y": "146", "o_a": "3.3", "z": "2"}, {"o_u": "3.04", "ovr": "3.4", "bat": "300631", "r_t": "4", "bowl": "53191", "r": "4", "comm": "and more! Length ball on off stump, Kusal barely inches forward because he knows it is all in his hands. Such forehand strength, reminiscent of his hero Sanath. Straight into the sightscreen", "x": "168", "y": "357", "o_a": "3.4", "z": "5"}, {"o_u": "3.05", "ovr": "3.5", "bat": "300631", "r_t": "1", "bowl": "53191", "r": "1", "comm": "<b>third run-out chance against Kusal</b> and he has a word with Dilshan about it all. Toe-ends it to mid-on and is called through for the single. Sammy is the man again taking aim, it bounces on the edge of the square and bounces over the stumps", "x": "137", "y": "231", "o_a": "3.5", "z": "5"}, {"o_u": "3.06", "ovr": "3.6", "bat": "48472", "r_t": "4", "bowl": "53191", "r": "4", "comm": "pulled away with considerable disdain. Can even the vaunted West Indies powerhitters match this? Picked up the short ball early and thumped it. The square leg umpire could well have had his leg in trouble there.", "x": "346", "y": "124", "o_a": "3.6", "z": "2"}, {"o_u": "4.01", "ovr": "4.1", "bat": "300631", "r_t": "0", "bowl": "230558", "r": "0", "comm": "<b>lbw appeal</b>. Catches him at the crease as Kusal looks to read him off the pitch. Good length ball that skids onto him and hits him on his pads. Flicking across the line has him in trouble, but it had pitched outside leg", "x": "0", "y": "0", "o_a": "4.1", "z": "0"}, {"o_u": "4.02", "ovr": "4.2", "bat": "300631", "r_t": "1", "bowl": "230558", "r": "1", "comm": "nudged towards short fine leg", "x": "154", "y": "101", "o_a": "4.2", "z": "8"}, {"o_u": "4.03", "ovr": "4.3", "bat": "48472", "r_t": "0", "bowl": "230558", "r": "0", "comm": "switch hit, no dilly dallying around from Dilshan! But the bowler denies him the pace. Floated up right on leg stump, so he is cramped as well, finds short third mna", "x": "154", "y": "108", "o_a": "4.3", "z": "8"}, {"o_u": "4.04", "ovr": "4.4", "bat": "48472", "r_t": "1", "bowl": "230558", "r": "1", "comm": "", "x": "257", "y": "177", "o_a": "4.4", "z": "3"}, {"o_u": "4.05", "ovr": "4.5", "bat": "300631", "r_t": "0", "bowl": "230558", "r": "0", "comm": "into the pull way too early, strikes the short ball off the bottom of the bat and the ricochet nearly dribbles onto the stumps. Fletcher, the wicketkeeper, has no idea where the ball is. Looks to long leg, then looks up in the air, in case he needs to catch it. Meanwhile, the ball is by his feet", "x": "197", "y": "151", "o_a": "4.5", "z": "2"}, {"o_u": "4.06", "ovr": "4.6", "bat": "300631", "r_t": "0", "bowl": "230558", "r": "0", "comm": "tossed up on off stump, defended", "x": "212", "y": "195", "o_a": "4.6", "z": "3"}, {"o_u": "5.01", "ovr": "5.1", "bat": "48472", "r_t": "4", "bowl": "391485", "r": "4", "comm": "saw the slower ball early, not that he needed to because it was a full toss. Tonked through midwicket. Not a happy start to his second spell for Holder. In fact, its the same start as his first spell", "x": "353", "y": "195", "o_a": "5.1", "z": "3"}, {"o_u": "5.02", "ovr": "5.2", "bat": "48472", "r_t": "0", "bowl": "391485", "r": "0", "comm": "too close to cut, and Holder gets his customary extra bounce. Dilshan comes second-best because of his own ambition", "x": "0", "y": "0", "o_a": "5.2", "z": "0"}, {"o_u": "5.03", "ovr": "5.3", "bat": "48472", "r_t": "1", "bowl": "391485", "r": "0", "comm": "pressure on the bowlers is showing big time. Full and dripping down leg, Holder and the wicketkeeper go up in appeal to try and distract the ump from calling it as he saw it. A wide", "x": "0", "y": "0", "o_a": "5.3", "z": "0"}, {"o_u": "5.04", "ovr": "5.3", "bat": "48472", "r_t": "4", "bowl": "391485", "r": "4", "comm": "these slower balls are not working, and how would they when he pitches it so short. It could well be the right ploy because this pitch is coming onto the bat brilliantly. But at halfway down, it just gives the batsman all the time he needs to see it and spank it to the midiwcket boundary", "x": "351", "y": "191", "o_a": "5.3", "z": "3"}, {"o_u": "5.05", "ovr": "5.4", "bat": "48472", "r_t": "1", "bowl": "391485", "r": "0", "comm": "full toss down the leg side, Dilshan looks for another boundary to long leg. But he cannot connect", "x": "0", "y": "0", "o_a": "5.4", "z": "0"}, {"o_u": "5.06", "ovr": "5.4", "bat": "48472", "r_t": "4", "bowl": "391485", "r": "4", "comm": "half an appeal, but Dilshan has inside edged this all the way to the long leg boundary. The slower ball lands where it is most potent - right up there on middle and leg - but Holder still comes out the loser", "x": "216", "y": "9", "o_a": "5.4", "z": "1"}, {"o_u": "5.07", "ovr": "5.5", "bat": "48472", "r_t": "1", "bowl": "391485", "r": "1", "comm": "low full toss on middle, picked away to deep midwicket", "x": "332", "y": "188", "o_a": "5.5", "z": "3"}, {"o_u": "5.08", "ovr": "5.6", "bat": "300631", "r_t": "2", "bowl": "391485", "r": "2", "comm": "sticks to change of pace, bowls it full on leg stump, Kusal clips it calmly to deep square leg for a couple", "x": "43", "y": "135", "o_a": "5.6", "z": "7"}, {"o_u": "6.01", "ovr": "6.1", "bat": "48472", "r_t": "0", "bowl": "230558", "r": "0", "comm": "slight fumble at short fine leg, everyone under pressure because of this rip-roaring start. Except Narine, who floads up a delivery at the base on middle and gets swept all along the ground", "x": "215", "y": "116", "o_a": "6.1", "z": "1"}, {"o_u": "6.02", "ovr": "6.2", "bat": "48472", "r_t": "1", "bowl": "230558", "r": "1", "comm": "88kph, quicker and just outside off, Dilshan tries to make room to cut, but only mistimes it", "x": "94", "y": "181", "o_a": "6.2", "z": "6"}, {"o_u": "6.03", "ovr": "6.3", "bat": "300631", "r_t": "0", "bowl": "230558", "r": "0", "comm": "just a hint of away turn, and he bowls it fullish too. Kusal, who seems to only pick him off the pitch, stays back and pushes into the covers", "x": "242", "y": "197", "o_a": "6.3", "z": "3"}, {"o_u": "6.04", "ovr": "6.4", "bat": "300631", "r_t": "1", "bowl": "230558", "r": "1", "comm": "now it is a lot slower, at 80 kph, on leg stump. Nudged towards short fine leg", "x": "148", "y": "48", "o_a": "6.4", "z": "8"}, {"o_u": "6.05", "ovr": "6.5", "bat": "48472", "r_t": "1", "bowl": "230558", "r": "1", "comm": "nicely tossed up on fourth stump, Dilshan is confident in reading him off the hand as he leans forward and plays with the turn to square leg", "x": "255", "y": "174", "o_a": "6.5", "z": "3"}, {"o_u": "6.06", "ovr": "6.6", "bat": "300631", "r_t": "0", "bowl": "230558", "r": "0", "comm": "just back of a length on middle and leg, defended, and immediately Kusal turns around and asks for a change of bat. This T20 generation, I tell you", "x": "153", "y": "200", "o_a": "6.6", "z": "5"}, {"o_u": "7.01", "ovr": "7.1", "bat": "48472", "r_t": "1", "bowl": "341593", "r": "1", "comm": "that's the skidder coming on with the arm to leg stump! At 85 kph, Dilshan was making room to flay it through the off side, but he has managed to adjust with his hands. Well done, by both parties. Single to mid-off", "x": "158", "y": "220", "o_a": "7.1", "z": "5"}, {"o_u": "7.02", "ovr": "7.2", "bat": "300631", "r_t": "1", "bowl": "341593", "r": "1", "comm": "drops it short, Kusal would have fancied himself a boundary. Pulls with all his might, but has picked up deep square leg", "x": "82", "y": "70", "o_a": "7.2", "z": "7"}, {"o_u": "7.03", "ovr": "7.3", "bat": "48472", "r_t": "1", "bowl": "341593", "r": "1", "comm": "flighted just outside off, Dilshan keeps legside of it though and drives to cover. Sammy dives but cannot prevent the single", "x": "117", "y": "209", "o_a": "7.3", "z": "6"}, {"o_u": "7.04", "ovr": "7.4", "bat": "300631", "r_t": "1", "bowl": "341593", "r": "1", "comm": "picked away to the right of deep midwicket, Russell is the man prowling there and he does not give them the opportunity for a second. So quick across the turf, even a slightly wet turf", "x": "35", "y": "205", "o_a": "7.4", "z": "6"}, {"o_u": "7.05", "ovr": "7.5", "bat": "48472", "r_t": "1", "bowl": "341593", "r": "1", "comm": "backs away and cuts through cover point, Russell and his Mr T hairdo get camera time again", "x": "47", "y": "103", "o_a": "7.5", "z": "7"}, {"o_u": "7.06", "ovr": "7.6", "bat": "300631", "r_t": "6", "bowl": "341593", "r": "6", "comm": "in the slot, didn't seem like the legspinner either. Probably the slider, but since it was pitched on a half-volley, it didn't matter. Kusal wound up his backlift and tonked it over wide long-on. Clever batting to punishing effect", "x": "79", "y": "323", "o_a": "7.6", "z": "5"}, {"o_u": "8.01", "ovr": "8.1", "bat": "48472", "r_t": "1", "bowl": "51439", "r": "1", "comm": "back of a length on off stump, knocked through midwicket", "x": "271", "y": "193", "o_a": "8.1", "z": "3"}, {"o_u": "8.02", "ovr": "8.2", "bat": "300631", "r_t": "0", "bowl": "51439", "r": "0", "comm": "width on offer, but Bravo masks his mistake by taking all the pace off. Only 113 kph and Kusal bunts it to short cover", "x": "215", "y": "243", "o_a": "8.2", "z": "4"}, {"o_u": "8.03", "ovr": "8.3", "bat": "300631", "r_t": "1", "bowl": "51439", "r": "1", "comm": "wide again, seems a ploy, and Kusal throws his hands at it. Forehanded down to long-on. That was the full-pace delivery. Hit off the bottom of the bat", "x": "234", "y": "314", "o_a": "8.3", "z": "4"}, {"o_u": "8.04", "ovr": "8.4", "bat": "48472", "r_t": "2", "bowl": "51439", "r": "2", "comm": "offcutter just outside off, Dilshan works it to long-on's right. Hit it soft enough to get the second run even with  Russell fielding down there. Looks set for a pretty effortless fifty", "x": "232", "y": "316", "o_a": "8.4", "z": "4"}, {"o_u": "8.05", "ovr": "8.5", "bat": "48472", "r_t": "1", "bowl": "51439", "r": "1", "comm": "good length ball on middle, picked away to deep midwicket. A loopy little throw comes in and I think it was not collected properly by the keeper. Dilshan, ever alert, wonders about the overthrow. But West indies get their act together quickly enough", "x": "328", "y": "192", "o_a": "8.5", "z": "3"}, {"o_u": "8.06", "ovr": "8.6", "bat": "300631", "r_t": "4", "bowl": "51439", "r": "4", "comm": "oh, that is superbly done! There is less than 100ks on this delivery, but Kusal has made all the pace himself. And he was able to do so because he waited on it. Then the big backlift comes down and powers the ball wide of the sweeper cover. Narine is the man there, and he fails to dive. Should have dived. Not good that", "x": "352", "y": "199", "o_a": "8.6", "z": "3"}, {"o_u": "9.01", "ovr": "9.1", "bat": "48472", "r_t": "1", "bowl": "230559", "r": "1", "comm": "starts short and offers room, pulled away strongly to deep square leg", "x": "328", "y": "134", "o_a": "9.1", "z": "2"}, {"o_u": "9.02", "ovr": "9.2", "bat": "300631", "r_t": "1", "bowl": "230559", "r": "1", "comm": "back of a length and outside off, patted to long-off", "x": "222", "y": "329", "o_a": "9.2", "z": "4"}, {"o_u": "9.03", "ovr": "9.3", "bat": "48472", "r_t": "1", "bowl": "230559", "r": "1", "comm": "nearly a yorker on off stump, Dilshan watches it hungrily, he is almost frozen in time, until the ball pitches by his feet. Then he whips it away through midwicket. Almost like a helicopter shot", "x": "324", "y": "222", "o_a": "9.3", "z": "3"}, {"o_u": "9.04", "ovr": "9.4", "bat": "300631", "r_t": "0", "bowl": "230559", "r": "0", "comm": "slower ball works! Pollard usually has a knack for this. Big, burly build. Last man you want to meet in a dark alley build. But he ambles in and bowls as if he has the muscles of a 10-year old. Kusal had lunged down the track and is there an age too early. he tries to adjust, delay his bat coming down, but does not do it well enough. The belt through cover becomes a catch spooned to Sammy", "x": "245", "y": "204", "o_a": "9.4", "z": "3"}, {"o_u": "9.05", "ovr": "9.5", "bat": "48472", "r_t": "0", "bowl": "230559", "r": "0", "comm": "full and outside off, punched to cover", "x": "130", "y": "206", "o_a": "9.5", "z": "6"}, {"o_u": "9.06", "ovr": "9.6", "bat": "48472", "r_t": "1", "bowl": "230559", "r": "1", "comm": "loopy full toss outside off, tapped to mid-off and he runs with the shot. Pallekele, where he rarely ever fails, stands up and salutes", "x": "162", "y": "263", "o_a": "9.6", "z": "5"}, {"o_u": "10.01", "ovr": "10.1", "bat": "48472", "r_t": "2", "bowl": "51439", "r": "2", "comm": "this is 85 kph, which has been why Dilshan does not find the boundary. Could perhaps have been the switch pull.", "x": "99", "y": "53", "o_a": "10.1", "z": "8"}, {"o_u": "10.02", "ovr": "10.2", "bat": "48472", "r_t": "1", "bowl": "51439", "r": "1", "comm": "good length ball outside off, runs down the track and finds mid-off", "x": "153", "y": "242", "o_a": "10.2", "z": "5"}, {"o_u": "10.03", "ovr": "10.3", "bat": "422965", "r_t": "1", "bowl": "51439", "r": "1", "comm": "punched to mid-off off the back foot. Room on offer, room taken advantage of", "x": "231", "y": "332", "o_a": "10.3", "z": "4"}, {"o_u": "10.04", "ovr": "10.4", "bat": "48472", "r_t": "1", "bowl": "51439", "r": "1", "comm": "back of a length and outside off, dabbed between point and short third man", "x": "125", "y": "118", "o_a": "10.4", "z": "7"}, {"o_u": "10.05", "ovr": "10.5", "bat": "422965", "r_t": "1", "bowl": "51439", "r": "1", "comm": "slower ball, down leg, gently glanced to short fine leg", "x": "149", "y": "106", "o_a": "10.5", "z": "8"}, {"o_u": "10.06", "ovr": "10.6", "bat": "48472", "r_t": "1", "bowl": "51439", "r": "1", "comm": "short and wide, Dilshan hammers it to deep point", "x": "38", "y": "176", "o_a": "10.6", "z": "6"}, {"o_u": "11.01", "ovr": "11.1", "bat": "48472", "r_t": "0", "bowl": "230559", "r": "0", "comm": "beaten all ends up - by the sheer lack of pace. Beautiful bowling from Pollard because he keeps it full. Almost teases the batsman. Here it is, come and get it. It's going to look like the rankest half-volley. And Dilshan looks for the big heave ho over long-on and comes up with a whole lot of nothing.", "x": "0", "y": "0", "o_a": "11.1", "z": "0"}, {"o_u": "11.02", "ovr": "11.2", "bat": "48472", "r_t": "1", "bowl": "230559", "r": "1", "comm": "pushed to long-on to get off strike", "x": "226", "y": "318", "o_a": "11.2", "z": "4"}, {"o_u": "11.03", "ovr": "11.3", "bat": "422965", "r_t": "0", "bowl": "230559", "r": "0", "comm": "slower ball, just on a good length and outside off, Shehan looks for the forceful cut and gets only an inside edge towards the keeper", "x": "196", "y": "143", "o_a": "11.3", "z": "1"}, {"o_u": "11.04", "ovr": "11.4", "bat": "422965", "r_t": "1", "bowl": "230559", "r": "1", "comm": "bowls from severely wide of the crease for a full ball outside off, smeared to the right of long-off", "x": "249", "y": "321", "o_a": "11.4", "z": "4"}, {"o_u": "11.05", "ovr": "11.5", "bat": "48472", "r_t": "0", "bowl": "230559", "r": "0", "comm": "bowled off the switch hit, and Pollard pulls out a novel celebration. Turns around away from the batsman and appears to be reading an imaginary book. Loopy slower ball that sneaks through the splayed legs of the batsman as he suddenly became a left-hander looking for the slog sweep. Ball goes under his bat and topples off stump. Lovely bowling from Pollard. Strong under pressure. Bowled from way behind the popping crease as well to get the ball to float up and hang in the air and dip after that.", "x": "0", "y": "0", "o_a": "11.5", "z": "0"}, {"o_u": "11.06", "ovr": "11.6", "bat": "300628", "r_t": "4", "bowl": "230559", "r": "4", "comm": "launched over extra cover - this is at 122 kph - and Chandimal welcomes the pace by pressing forward and holing nothing back.", "x": "54", "y": "305", "o_a": "11.6", "z": "5"}, {"o_u": "12.01", "ovr": "12.1", "bat": "422965", "r_t": "1", "bowl": "53115", "r": "1", "comm": "around the wicket to keep the room down, good length ball on off stump, patted towards point", "x": "234", "y": "136", "o_a": "12.1", "z": "2"}, {"o_u": "12.02", "ovr": "12.2", "bat": "300628", "r_t": "2", "bowl": "53115", "r": "2", "comm": "shortish on middle and leg, whipped away to deep square leg", "x": "310", "y": "175", "o_a": "12.2", "z": "3"}, {"o_u": "12.03", "ovr": "12.3", "bat": "300628", "r_t": "1", "bowl": "53115", "r": "1", "comm": "backs away and slaps it into the off side for a single", "x": "130", "y": "212", "o_a": "12.3", "z": "6"}, {"o_u": "12.04", "ovr": "12.4", "bat": "422965", "r_t": "1", "bowl": "53115", "r": "1", "comm": "runs down the track and flatbats it to long-on", "x": "95", "y": "298", "o_a": "12.4", "z": "5"}, {"o_u": "12.05", "ovr": "12.5", "bat": "300628", "r_t": "4", "bowl": "53115", "r": "4", "comm": "flays it through cover again. it was a low full toss, so he pushed forward, made sure he had enough room and let the hands just flow", "x": "23", "y": "260", "o_a": "12.5", "z": "6"}, {"o_u": "12.06", "ovr": "12.6", "bat": "300628", "r_t": "4", "bowl": "53115", "r": "4", "comm": "the loopy slower ball ends up a half volley and Chandimal powers it through extra cover. The bent-knee kind of drive as well. Looked pretty and did not lack in power either", "x": "24", "y": "256", "o_a": "12.6", "z": "6"}, {"o_u": "13.01", "ovr": "13.1", "bat": "422965", "r_t": "4", "bowl": "230559", "r": "4", "comm": "nearly cleaned up the non-striker. That was at 101 kph, just outside off. Shehan made the room himself to take advantage of the length and smeared it to the long-off boundary", "x": "222", "y": "353", "o_a": "13.1", "z": "4"}, {"o_u": "13.02", "ovr": "13.2", "bat": "422965", "r_t": "2", "bowl": "230559", "r": "2", "comm": "low full toss on leg stump, whipped away between midwicket and deep square leg", "x": "33", "y": "216", "o_a": "13.2", "z": "6"}, {"o_u": "13.03", "ovr": "13.3", "bat": "422965", "r_t": "0", "bowl": "230559", "r": "0", "comm": "goes for the short ball, it's at his full pace, Shehan looks to play the ramp with third man up but he cannot make contact. Yells in absolute disgust at missing out", "x": "0", "y": "0", "o_a": "13.3", "z": "0"}, {"o_u": "13.04", "ovr": "13.4", "bat": "422965", "r_t": "1", "bowl": "230559", "r": "1", "comm": "drops just short of point, so he can get a single and think about it. it's the offcutter to which Shehan tries to make room and cut. Could easily have been caught instead. Lack of room, and the batsman's own unnecessary enthusiasm, nearly worked", "x": "246", "y": "144", "o_a": "13.4", "z": "2"}, {"o_u": "13.05", "ovr": "13.5", "bat": "300628", "r_t": "1", "bowl": "230559", "r": "1", "comm": "wide of the crease for a full delivery angled in on off stump, Chandimal whips it to long-on", "x": "234", "y": "327", "o_a": "13.5", "z": "4"}, {"o_u": "13.06", "ovr": "13.6", "bat": "422965", "r_t": "1", "bowl": "230559", "r": "1", "comm": "but that was crisp! That must be why he hacks himself to cut balls even when there is no room. Excellently timed, but straight at point, who is deep enough for the single", "x": "252", "y": "149", "o_a": "13.6", "z": "2"}, {"o_u": "14.01", "ovr": "14.1", "bat": "422965", "r_t": "0", "bowl": "230558", "r": "0", "comm": "a little turn away from the bat, Shehan can only glide it to backward point", "x": "243", "y": "149", "o_a": "14.1", "z": "2"}, {"o_u": "14.02", "ovr": "14.2", "bat": "422965", "r_t": "1", "bowl": "230558", "r": "0", "comm": "slips it down leg, Shehan goes for the pull but cannot strike it", "x": "0", "y": "0", "o_a": "14.2", "z": "0"}, {"o_u": "14.03", "ovr": "14.2", "bat": "422965", "r_t": "1", "bowl": "230558", "r": "1", "comm": "looped up on middle, Shehan wants the slog sweep now. Inside edges to deep midwicket", "x": "36", "y": "196", "o_a": "14.2", "z": "6"}, {"o_u": "14.04", "ovr": "14.3", "bat": "300628", "r_t": "1", "bowl": "230558", "r": "0", "comm": "oh, is that a switch hit too? Chandimal is not looking to take a backward step. Finds a single over the keeper's head though", "x": "190", "y": "105", "o_a": "14.3", "z": "1"}, {"o_u": "14.05", "ovr": "14.4", "bat": "422965", "r_t": "0", "bowl": "230558", "r": "0", "comm": "pushed through wide outside off, and gets away with it", "x": "0", "y": "0", "o_a": "14.4", "z": "0"}, {"o_u": "14.06", "ovr": "14.5", "bat": "422965", "r_t": "1", "bowl": "230558", "r": "1", "comm": "tossed up on off stump, dabbed through cover", "x": "241", "y": "148", "o_a": "14.5", "z": "2"}, {"o_u": "14.07", "ovr": "14.6", "bat": "300628", "r_t": "0", "bowl": "230558", "r": "0", "comm": "length ball outside off, swept straight to short fine leg. That's only four runs off the over", "x": "244", "y": "136", "o_a": "14.6", "z": "2"}, {"o_u": "15.01", "ovr": "15.1", "bat": "422965", "r_t": "4", "bowl": "230559", "r": "4", "comm": "oh, well done, Shehan! If Pollard has one-upped Sri Lanka by lack of pace, Shehan exploits the loophole. Saw fine leg and third man up, so he wandered outside off and scoops the full toss to the boundary behind him", "x": "154", "y": "6", "o_a": "15.1", "z": "8"}, {"o_u": "15.02", "ovr": "15.2", "bat": "422965", "r_t": "1", "bowl": "230559", "r": "1", "comm": "slower ball on off stump, belted down the ground and it comes so quickly that Chandimal cannot get his bat away in time. Ricochets off it to long-on", "x": "235", "y": "326", "o_a": "15.2", "z": "4"}, {"o_u": "15.03", "ovr": "15.3", "bat": "300628", "r_t": "1", "bowl": "230559", "r": "1", "comm": "belted down the ground", "x": "245", "y": "313", "o_a": "15.3", "z": "4"}, {"o_u": "15.04", "ovr": "15.4", "bat": "422965", "r_t": "6", "bowl": "230559", "r": "6", "comm": "well, they might need to enlist someone from the crowd to help out. This is a slow, length ball, looks like the batsman are expecting the slower balls now. Just waited and waited and waited before slog sweeping this miles over midwicket", "x": "10", "y": "205", "o_a": "15.4", "z": "6"}, {"o_u": "15.05", "ovr": "15.5", "bat": "422965", "r_t": "3", "bowl": "230559", "r": "2", "comm": "loses control of a slower ball, slips out of his hand, and comes at the batsman well over waist high. And Shehan had jumped back and across right beside the line of off stump. Then he pulls over short fine leg. Taylor does his absolute best to dive forward after it and pull it back. The fielder disturbs the position of the advertising triangles and the ball trickles over to where it had been originally. Should be four, but it is only two. Anywway, they have a free hit to take toll of", "x": "147", "y": "14", "o_a": "15.5", "z": "8"}, {"o_u": "15.06", "ovr": "15.5", "bat": "422965", "r_t": "2", "bowl": "230559", "r": "2", "comm": "length ball, Shehan looks to heave it over midwicket. Does not have enough power. Just had a lot of height. Russell takes the catch and then throws it back", "x": "58", "y": "243", "o_a": "15.5", "z": "6"}, {"o_u": "15.07", "ovr": "15.6", "bat": "422965", "r_t": "6", "bowl": "230559", "r": "6", "comm": "top-edged six, this time off the full-paced delivery and Pollard's final over has gone for 23 runs. Massive momentum shift to Sri Lanka just when they had been fidgeting. Shehan has been at the centre of it all, a little iffy at first, but then he has played some excellent, percentage cricket", "x": "143", "y": "6", "o_a": "15.6", "z": "8"}, {"o_u": "16.01", "ovr": "16.1", "bat": "300628", "r_t": "1", "bowl": "230558", "r": "1", "comm": "short and wide, belted to the sweeper cover", "x": "34", "y": "183", "o_a": "16.1", "z": "6"}, {"o_u": "16.02", "ovr": "16.2", "bat": "422965", "r_t": "0", "bowl": "230558", "r": "0", "comm": "looks for the slog sweep, gets a top edge, this will be a difficult take for the bowler running backwards and looking over his head. Reaches out to try and get the swirling ball under control and he does brilliantly. Hitting against the turn does not work for Shehan, but this is late enough in the innings that you can't fault his shot selection. Impressive little innings. Showed he could work through a bit of trouble early and unfurled a lovely range of shots", "x": "142", "y": "236", "o_a": "16.2", "z": "5"}, {"o_u": "16.03", "ovr": "16.3", "bat": "300628", "r_t": "4", "bowl": "230558", "r": "4", "comm": "reverse sweep all the way to the point boundary. Top strike. Got into the shot early perhaps because he knew it would be a length ball and Narine has not been turning the ball big. Treated him like a medium pacer", "x": "32", "y": "78", "o_a": "16.3", "z": "7"}, {"o_u": "16.04", "ovr": "16.4", "bat": "300628", "r_t": "0", "bowl": "230558", "r": "0", "comm": "this time it is tossed up a bit more and it dips under the bat and hits him on the thigh. Impact outside the line", "x": "0", "y": "0", "o_a": "16.4", "z": "0"}, {"o_u": "16.05", "ovr": "16.5", "bat": "300628", "r_t": "6", "bowl": "230558", "r": "6", "comm": "in the slot in the slog overs. And Chandimal is keeping Pallekele buzzing. Heaved over long-on. Picks the offbreak, goes with the spin and he is showing why Sri Lanka rate him so highly. Raw, homespun talent", "x": "303", "y": "319", "o_a": "16.5", "z": "4"}, {"o_u": "16.06", "ovr": "16.6", "bat": "300628", "r_t": "1", "bowl": "230558", "r": "1", "comm": "nudged through midwicket as Narine goes flat and quick on off stump. Two back to back big overs here", "x": "319", "y": "240", "o_a": "16.6", "z": "3"}, {"o_u": "17.01", "ovr": "17.1", "bat": "300628", "r_t": "6", "bowl": "51439", "r": "6", "comm": "length ball way down leg, Chandimal wallops it away to the fine leg boundary. It was almost as if he could barely believe how bad that ball was and couldn't wait to tuck into it", "x": "337", "y": "92", "o_a": "17.1", "z": "2"}, {"o_u": "17.02", "ovr": "17.2", "bat": "300628", "r_t": "2", "bowl": "51439", "r": "2", "comm": "into the blockhole now, but the luck is with Chandimal. Digs it out and finds a couple through midwicket because that man is deep. Another perk of the kind of hitting the batsman has displayed.", "x": "319", "y": "209", "o_a": "17.2", "z": "3"}, {"o_u": "17.03", "ovr": "17.3", "bat": "300628", "r_t": "1", "bowl": "51439", "r": "1", "comm": "length ball, slower, Chandimal slog sweeps to deep midwicket", "x": "308", "y": "241", "o_a": "17.3", "z": "3"}, {"o_u": "17.04", "ovr": "17.4", "bat": "49764", "r_t": "6", "bowl": "51439", "r": "6", "comm": "phew, first ball! Angelo Mathews announces himself in style. Sees the slower ball early, is helped out by said slower ball being so short. He just waits on his front foot and slugs it miles to midwicket", "x": "340", "y": "254", "o_a": "17.4", "z": "3"}, {"o_u": "17.05", "ovr": "17.5", "bat": "49764", "r_t": "6", "bowl": "51439", "r": "6", "comm": "now its a full toss, just a whirl of the wrists and Mathews has back-to-back sixes.", "x": "353", "y": "185", "o_a": "17.5", "z": "3"}, {"o_u": "17.06", "ovr": "17.6", "bat": "49764", "r_t": "1", "bowl": "51439", "r": "0", "comm": "now he finds the leg-stump yorker he was looking for. Slips under Mathews' bat as he tries to flick and ends up as leg byes towards point", "x": "120", "y": "118", "o_a": "17.6", "z": "7"}, {"o_u": "18.01", "ovr": "18.1", "bat": "49764", "r_t": "2", "bowl": "53191", "r": "2", "comm": "starts well. Finds a yorker at 140 kph, whipped away through midwicket. And oh dear, Russell has rushed in and taken his eyes off the ball to get ready for the throw a bit too early. Gives away the extra run", "x": "319", "y": "235", "o_a": "18.1", "z": "3"}, {"o_u": "18.02", "ovr": "18.2", "bat": "49764", "r_t": "1", "bowl": "53191", "r": "1", "comm": "low full toss outside off, driven to long-off", "x": "153", "y": "324", "o_a": "18.2", "z": "5"}, {"o_u": "18.03", "ovr": "18.3", "bat": "300628", "r_t": "1", "bowl": "53191", "r": "1", "comm": "full toss, but a little higher and outside off, Chandimal blasts it to long-on", "x": "246", "y": "319", "o_a": "18.3", "z": "4"}, {"o_u": "18.04", "ovr": "18.4", "bat": "49764", "r_t": "0", "bowl": "53191", "r": "0", "comm": "sneaks in the short ball, which Mathews does not seem to expect. Tries to adjust by playing something like a shovel-flick. Misses it. Good bowling, lack of room and good pace", "x": "0", "y": "0", "o_a": "18.4", "z": "0"}, {"o_u": "18.05", "ovr": "18.5", "bat": "49764", "r_t": "6", "bowl": "53191", "r": "6", "comm": "in the slot and that's his third six in seven balls! Highest score at Pallekele now. All he needed to do was go through with the shot. Bat swings down on the ball with menace and makes the arc all the way back to his waist", "x": "246", "y": "349", "o_a": "18.5", "z": "4"}, {"o_u": "18.06", "ovr": "18.6", "bat": "49764", "r_t": "1", "bowl": "53191", "r": "1", "comm": "full on middle and leg, picked away to long-on and he is disappointed that he got that away for just a single.", "x": "229", "y": "320", "o_a": "18.6", "z": "4"}, {"o_u": "19.01", "ovr": "19.1", "bat": "49764", "r_t": "1", "bowl": "51439", "r": "1", "comm": "length ball outside off, Mathews seems to have come at it too early and is restricted to a single to long-on. Not happy at all with the result after he jogs through to the other end. Flays his bat at the air", "x": "231", "y": "333", "o_a": "19.1", "z": "4"}, {"o_u": "19.02", "ovr": "19.2", "bat": "300628", "r_t": "1", "bowl": "51439", "r": "1", "comm": "highish full toss just outside off, Chandimal slogs and gets it off the splice to long-off.", "x": "155", "y": "327", "o_a": "19.2", "z": "5"}, {"o_u": "19.03", "ovr": "19.3", "bat": "49764", "r_t": "6", "bowl": "51439", "r": "6", "comm": "how about that! He had been giving himself quite a hard time at mistiming a few. This time he has picked up a low full toss, bowled from wide of the crease, exploits the angle into him and them whips it away over square leg. Massive power generated from just his wrists. Beautifully brutal!", "x": "355", "y": "213", "o_a": "19.3", "z": "3"}, {"o_u": "19.04", "ovr": "19.4", "bat": "49764", "r_t": "0", "bowl": "51439", "r": "0", "comm": "slower ball, beats Mathews outside off!", "x": "0", "y": "0", "o_a": "19.4", "z": "0"}, {"o_u": "19.05", "ovr": "19.5", "bat": "49764", "r_t": "4", "bowl": "51439", "r": "4", "comm": "getting a flood of full tosses as West Indies look for the yorker. Bravo hats his luck. Sri Lanka have another boundary, Mathews is picking the gaps to perfection. This through straight midwcket", "x": "334", "y": "277", "o_a": "19.5", "z": "3"}, {"o_u": "19.06", "ovr": "19.6", "bat": "49764", "r_t": "4", "bowl": "51439", "r": "4", "comm": "Another boundary, this one to long leg. What a partnership! Granted the bowler has been appalling, but the way Mathews has just come out all guns blazing has been something special to watch. Another wristy flourish as he sends the leg-stump length ball away", "x": "327", "y": "85", "o_a": "19.6", "z": "2"}]}